{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0",
    "1"
  ],
  "id": "295e5cd6-4c2e-4bf2-a491-3b8832e23a19",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2021-08-11T10:25:49.5249655Z",
  "description": "User-based Windows compliance policy that applies to all default scenarios including physical Windows PCs.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-09-09T08:53:31.5497687Z",
  "displayName": "Prod-Windows-AllDevice-CompliancePolicy",
  "version": 18,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.19045",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "memoryIntegrityEnabled": false,
  "kernelDmaProtectionEnabled": false,
  "virtualizationBasedSecurityEnabled": false,
  "firmwareProtectionEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": true,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": true,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": true,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
  "validOperatingSystemBuildRanges": [],
  "wslDistributions@odata.type": "#Collection(microsoft.graph.wslDistributionConfiguration)",
  "wslDistributions": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')",
      "id": "295e5cd6-4c2e-4bf2-a491-3b8832e23a19",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionConfigurations('9142f075-0023-4674-a1e8-889546a7c903')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionsForRule('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/scheduledActionConfigurations('9142f075-0023-4674-a1e8-889546a7c903')",
          "id": "9142f075-0023-4674-a1e8-889546a7c903",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('295e5cd6-4c2e-4bf2-a491-3b8832e23a19')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
