{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "35a58c35-caac-48f1-92ac-ac10045fc603",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2022-12-17T07:35:41.6658821Z",
  "description": "Device-based Windows compliance policy that applies to Azure Virtual Desktop multi-session - assign to All Devices with a filter that includes AVD multi-session hosts or an Entra ID group that targets those session hosts.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-19T22:51:54.2282278Z",
  "displayName": "Prod-Windows-AzureVirtualDesktop-CompliancePolicy",
  "version": 5,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.19045",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "memoryIntegrityEnabled": false,
  "kernelDmaProtectionEnabled": false,
  "virtualizationBasedSecurityEnabled": false,
  "firmwareProtectionEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": false,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
  "validOperatingSystemBuildRanges": [],
  "wslDistributions@odata.type": "#Collection(microsoft.graph.wslDistributionConfiguration)",
  "wslDistributions": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')",
      "id": "35a58c35-caac-48f1-92ac-ac10045fc603",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionConfigurations('c2f56190-a12d-4c40-96d6-433493658ce3')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionsForRule('35a58c35-caac-48f1-92ac-ac10045fc603')/scheduledActionConfigurations('c2f56190-a12d-4c40-96d6-433493658ce3')",
          "id": "c2f56190-a12d-4c40-96d6-433493658ce3",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('35a58c35-caac-48f1-92ac-ac10045fc603')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
