"{ \"settings\": [\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"id\": \"0acccaee-ae55-4843-b294-025453d8dbd0\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy\",\r\n    \"valueJson\": \"{\\\"startupAuthenticationRequired\\\":true,\\\"startupAuthenticationTpmUsage\\\":\\\"required\\\",\\\"startupAuthenticationTpmPinUsage\\\":null,\\\"startupAuthenticationTpmKeyUsage\\\":null,\\\"startupAuthenticationTpmPinAndKeyUsage\\\":null,\\\"startupAuthenticationBlockWithoutTpmChip\\\":true,\\\"prebootRecoveryEnableMessageAndUrl\\\":false,\\\"prebootRecoveryMessage\\\":null,\\\"prebootRecoveryUrl\\\":null,\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"allowed\\\",\\\"recoveryInformationToStore\\\":\\\"passwordAndKey\\\",\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"allowed\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":false},\\\"encryptionMethod\\\":\\\"xtsAes128\\\",\\\"minimumPinLength\\\":null}\",\r\n    \"value@odata.associationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n    \"value@odata.navigationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"id\": \"11fcb73b-4343-4a94-8588-10fbb4757469\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy\",\r\n    \"valueJson\": \"{\\\"recoveryOptions\\\":{\\\"recoveryKeyUsage\\\":\\\"blocked\\\",\\\"recoveryInformationToStore\\\":null,\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryPasswordUsage\\\":\\\"required\\\",\\\"hideRecoveryOptions\\\":false,\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true,\\\"blockDataRecoveryAgent\\\":false},\\\"requireEncryptionForWriteAccess\\\":false,\\\"encryptionMethod\\\":\\\"xtsAes128\\\"}\",\r\n    \"value@odata.associationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n    \"value@odata.navigationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('6ebfb342-0ee9-4634-b224-63ce90fc882c')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('6ebfb342-0ee9-4634-b224-63ce90fc882c')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"6ebfb342-0ee9-4634-b224-63ce90fc882c\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice\",\r\n    \"valueJson\": \"true\",\r\n    \"value\": true\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('75feb7f0-4938-4411-abfc-715821e6b1d1')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('75feb7f0-4938-4411-abfc-715821e6b1d1')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"75feb7f0-4938-4411-abfc-715821e6b1d1\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption\",\r\n    \"valueJson\": \"true\",\r\n    \"value\": true\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('bb6fb8e7-2a06-43de-84ab-80ee24167cc4')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('bb6fb8e7-2a06-43de-84ab-80ee24167cc4')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"bb6fb8e7-2a06-43de-84ab-80ee24167cc4\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile\",\r\n    \"valueJson\": \"false\",\r\n    \"value\": false\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('83bbc13b-5441-4444-aecd-a1f66c08c5e8')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('83bbc13b-5441-4444-aecd-a1f66c08c5e8')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"83bbc13b-5441-4444-aecd-a1f66c08c5e8\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption\",\r\n    \"valueJson\": \"true\",\r\n    \"value\": true\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance\",\r\n    \"id\": \"335ef691-c366-43a8-a778-da1e31870471\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy\",\r\n    \"valueJson\": \"{\\\"encryptionMethod\\\":\\\"xtsAes128\\\",\\\"requireEncryptionForWriteAccess\\\":false,\\\"blockCrossOrganizationWriteAccess\\\":false}\",\r\n    \"value@odata.associationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref\",\r\n    \"value@odata.navigationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance/value\"\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('e582e949-4ac0-4f63-aba5-dee17ec3b9e7')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('e582e949-4ac0-4f63-aba5-dee17ec3b9e7')/microsoft.graph.deviceManagementStringSettingInstance\",\r\n    \"id\": \"e582e949-4ac0-4f63-aba5-dee17ec3b9e7\",\r\n    \"definitionId\": \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation\",\r\n    \"valueJson\": \"\\\"enabledForAzureAdAndHybrid\\\"\",\r\n    \"value\": \"enabledForAzureAdAndHybrid\"\r\n  }\r\n]\n}"
