{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementIntent",
  "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')",
  "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')",
  "id": "9325aa9c-0bc3-43d2-a3dd-620642dc7054",
  "displayName": "Prod-Windows-BitLocker",
  "description": "Windows BitLocker settings to enable encryption for fixed drives with the default AES 128 bit XTS encryption, enable encryption for standard users and backup of the key to Entra ID. Apply to All Devices (optionally with filters) or Entra ID device groups.",
  "isAssigned": false,
  "isMigratingToConfigurationPolicy": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-06-15T23:26:54.7994211Z",
  "templateId": "d1174162-1dd2-4976-affc-6667049ab0ae",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0",
    "1"
  ],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance",
      "id": "0acccaee-ae55-4843-b294-025453d8dbd0",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
      "valueJson": "{\"startupAuthenticationRequired\":true,\"startupAuthenticationTpmUsage\":\"required\",\"startupAuthenticationTpmPinUsage\":null,\"startupAuthenticationTpmKeyUsage\":null,\"startupAuthenticationTpmPinAndKeyUsage\":null,\"startupAuthenticationBlockWithoutTpmChip\":true,\"prebootRecoveryEnableMessageAndUrl\":false,\"prebootRecoveryMessage\":null,\"prebootRecoveryUrl\":null,\"recoveryOptions\":{\"recoveryKeyUsage\":\"allowed\",\"recoveryInformationToStore\":\"passwordAndKey\",\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"allowed\",\"hideRecoveryOptions\":true,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":false},\"encryptionMethod\":\"xtsAes128\",\"minimumPinLength\":null}",
      "value@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
      "value@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('0acccaee-ae55-4843-b294-025453d8dbd0')/microsoft.graph.deviceManagementComplexSettingInstance/value"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance",
      "id": "11fcb73b-4343-4a94-8588-10fbb4757469",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
      "valueJson": "{\"recoveryOptions\":{\"recoveryKeyUsage\":\"blocked\",\"recoveryInformationToStore\":null,\"enableRecoveryInformationSaveToStore\":true,\"recoveryPasswordUsage\":\"required\",\"hideRecoveryOptions\":false,\"enableBitLockerAfterRecoveryInformationToStore\":true,\"blockDataRecoveryAgent\":false},\"requireEncryptionForWriteAccess\":false,\"encryptionMethod\":\"xtsAes128\"}",
      "value@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
      "value@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('11fcb73b-4343-4a94-8588-10fbb4757469')/microsoft.graph.deviceManagementComplexSettingInstance/value"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('6ebfb342-0ee9-4634-b224-63ce90fc882c')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('6ebfb342-0ee9-4634-b224-63ce90fc882c')/microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "6ebfb342-0ee9-4634-b224-63ce90fc882c",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('75feb7f0-4938-4411-abfc-715821e6b1d1')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('75feb7f0-4938-4411-abfc-715821e6b1d1')/microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "75feb7f0-4938-4411-abfc-715821e6b1d1",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('bb6fb8e7-2a06-43de-84ab-80ee24167cc4')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('bb6fb8e7-2a06-43de-84ab-80ee24167cc4')/microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "bb6fb8e7-2a06-43de-84ab-80ee24167cc4",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
      "valueJson": "false",
      "value": false
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('83bbc13b-5441-4444-aecd-a1f66c08c5e8')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('83bbc13b-5441-4444-aecd-a1f66c08c5e8')/microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "83bbc13b-5441-4444-aecd-a1f66c08c5e8",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance",
      "id": "335ef691-c366-43a8-a778-da1e31870471",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
      "valueJson": "{\"encryptionMethod\":\"xtsAes128\",\"requireEncryptionForWriteAccess\":false,\"blockCrossOrganizationWriteAccess\":false}",
      "value@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance/value/$ref",
      "value@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('335ef691-c366-43a8-a778-da1e31870471')/microsoft.graph.deviceManagementComplexSettingInstance/value"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "@odata.id": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('e582e949-4ac0-4f63-aba5-dee17ec3b9e7')",
      "@odata.editLink": "deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/settings('e582e949-4ac0-4f63-aba5-dee17ec3b9e7')/microsoft.graph.deviceManagementStringSettingInstance",
      "id": "e582e949-4ac0-4f63-aba5-dee17ec3b9e7",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
      "valueJson": "\"enabledForAzureAdAndHybrid\"",
      "value": "enabledForAzureAdAndHybrid"
    }
  ],
  "categories@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/categories/$ref",
  "categories@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/categories",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceSettingStateSummaries",
  "deviceStates@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceStates/$ref",
  "deviceStates@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceStates",
  "deviceStateSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceStateSummary/$ref",
  "deviceStateSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/deviceStateSummary",
  "userStates@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/userStates/$ref",
  "userStates@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/userStates",
  "userStateSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/userStateSummary/$ref",
  "userStateSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/userStateSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.assign"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.migrateToTemplate": {
    "title": "microsoft.graph.migrateToTemplate",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.migrateToTemplate"
  },
  "#microsoft.graph.updateSettings": {
    "title": "microsoft.graph.updateSettings",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.updateSettings"
  },
  "#microsoft.graph.compare(templateId)": {
    "title": "microsoft.graph.compare",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.compare(templateId=@templateId)"
  },
  "#microsoft.graph.getCustomizedSettings": {
    "title": "microsoft.graph.getCustomizedSettings",
    "target": "https://graph.microsoft.com/beta/deviceManagement/intents('9325aa9c-0bc3-43d2-a3dd-620642dc7054')/microsoft.graph.getCustomizedSettings"
  }
}
