{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')",
  "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-06T03:09:45.6925785Z",
  "creationSource": null,
  "description": "Configure target devices in Shared PC mode. Team with self-deploy Windows Autopilot",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-06T03:09:45.6925785Z",
  "name": "Prod-Windows-SharedPC-SettingsCatalog",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 12,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm",
  "id": "eba5939c-dbd9-4ceb-abe8-39ae837bc7a6",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/assignments",
  "assignments": [
    {
      "id": "eba5939c-dbd9-4ceb-abe8-39ae837bc7a6_adadadad-808e-44e2-905a-0b7873a8a531",
      "source": "direct",
      "sourceId": "eba5939c-dbd9-4ceb-abe8-39ae837bc7a6",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": "3f716f7c-fa72-44d2-a171-470d64517233",
        "deviceAndAppManagementAssignmentFilterType": "include"
      }
    }
  ],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_accountmodel",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_accountmodel_2",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_deletionpolicy",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_deletionpolicy_2",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_disklevelcaching",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 25
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_diskleveldeletion",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 25
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_enableaccountmanager",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_enableaccountmanager_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_enablesharedpcmode",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_enablesharedpcmode_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_inactivethreshold",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 30
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_maintenancestarttime",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 0
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_restrictlocalstorage",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_restrictlocalstorage_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_setedupolicies",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_setedupolicies_false",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('9')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('10')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('10')",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_setpowerpolicies",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_setpowerpolicies_false",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('10')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('10')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('11')",
      "@odata.editLink": "deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('11')",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_sharedpc_signinonresume",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "vendor_msft_sharedpc_signinonresume_false",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('11')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/settings('11')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('eba5939c-dbd9-4ceb-abe8-39ae837bc7a6')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
