{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-03-06T03:09:30.7360972Z",
    "creationSource":  null,
    "description":  "Standard Windows corporate user interface settings to restrict access to consumer features and Microsoft accounts, configures Start menu and Taskbar options, hides public links in the Microsoft Store, etc. Apply to All Users (optionally with filters) or Entra ID user groups.",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-09-14T06:57:14.4261796Z",
    "name":  "Prod-Windows-WindowsFeatures-Baseline-User",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0",
                            "1"
                        ],
    "settingCount":  6,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "1023d8cc-9bb2-45da-b98f-f6baed99588e",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_windowsexplorer_nomanagemycomputerverb",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_windowsexplorer_nomanagemycomputerverb_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_windowsexplorer_nonetconnectdisconnect",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_windowsexplorer_nonetconnectdisconnect_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_sensors_disablelocation_1",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_sensors_disablelocation_1_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowwindowsspotlight",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_experience_allowwindowsspotlight_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowtailoredexperienceswithdiagnosticdata",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_experience_allowtailoredexperienceswithdiagnosticdata_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_experience_allowwindowsconsumerfeatures",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_experience_allowwindowsconsumerfeatures_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightonactioncenter",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightonactioncenter_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightwindowswelcomeexperience",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightwindowswelcomeexperience_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_experience_allowwindowstips",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_experience_allowwindowstips_1",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_configurewindowsspotlightonlockscreen",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "user_vendor_msft_policy_config_experience_configurewindowsspotlightonlockscreen_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightonsettings",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_experience_allowwindowsspotlightonsettings_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00275\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00275\u0027)",
                         "id":  "5",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_settings_pagevisibilitylist",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "hide:gaming-gamebar;gaming-gamedvr;gaming-gamemode;deviceusage"
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/settings(\u00275\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00271023d8cc-9bb2-45da-b98f-f6baed99588e\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
