{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-09-14T06:49:10.7053625Z",
    "creationSource":  null,
    "description":  "Configurations for device lock and sign-in. Apply to All Devices with optional features, or copy to create settings to apply to different device types",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-09-17T01:10:58.6794586Z",
    "name":  "Prod-Windows-DeviceLockSignIn-Baseline-Device",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0",
                            "1"
                        ],
    "settingCount":  3,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "8b66b290-4bdf-489d-964c-05fa3f2b4c77",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/assignments",
    "assignments":  [

                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription_0",
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowslogon_allowautomaticrestartsignon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_windowslogon_allowautomaticrestartsignon_1",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelock",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  10
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278b66b290-4bdf-489d-964c-05fa3f2b4c77\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
