{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')",
  "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-06T03:09:45.1388777Z",
  "creationSource": null,
  "description": "Windows Security Center settings and support contact into. Assign to 'All Users'",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-06T03:09:45.1388777Z",
  "name": "Prod-Windows-SecurityExperience",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 18,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,microsoftSense",
  "id": "e79fc161-e57f-45d5-9e83-bf3cf8f5af88",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "d948ff9b-99cb-4ee0-8012-1fbc09685377_1",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "endpointSecurityAntivirus",
    "templateDisplayName": "Windows Security Experience",
    "templateDisplayVersion": "Version 1"
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/assignments",
  "assignments": [
    {
      "id": "e79fc161-e57f-45d5-9e83-bf3cf8f5af88_adadadad-808e-44e2-905a-0b7873a8a531",
      "source": "direct",
      "sourceId": "e79fc161-e57f-45d5-9e83-bf3cf8f5af88",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": null,
        "deviceAndAppManagementAssignmentFilterType": "none"
      }
    }
  ],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "ac41827d-76a1-47fc-a457-d399b5f73181"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "3c9b8f91-de2d-4722-8eb5-df9a8a2e8830",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableappbrowserui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "66e00605-0812-4071-8ebd-25c59e21da53"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableappbrowserui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "1e13433f-873d-4887-bb7f-3ee3da08b23d",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "b74cf007-28b9-472d-908c-943963a8e933"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "a87e6581-4959-4c05-962c-ebfff40bf7a0",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disabledevicesecurityui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "2d94cb1f-cbd6-4c9e-8117-1e3b0f3538d8"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disabledevicesecurityui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "5015408c-9b54-4fe2-8901-049893a887b9",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablefamilyui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "afcadc31-118d-4a5f-8a70-9f214389aa11"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablefamilyui_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "6add170a-7868-41d1-82a9-1038d2b3ce2b",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablehealthui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "b5b6359e-b835-420d-a341-9ed4e1340b82"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablehealthui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "ebff67f1-8ca3-4450-a58e-ca4a7fa30e17",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablenetworkui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "5f789df1-df7d-446e-bac4-f00bde46d9f2"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablenetworkui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "46da9ebb-fe6a-4a70-8e2d-6a3359ddb655",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableenhancednotifications",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "90d71ec1-eace-4cf1-a2da-023962fac6c5"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableenhancednotifications_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "aeb811f1-7980-4c19-a6b9-959aa84582c8",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disabletpmfirmwareupdatewarning",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "97f189ba-bcf6-4cd4-9b28-84866e982486"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disabletpmfirmwareupdatewarning_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "355986f7-fe53-4d4b-957c-babcf6d3cd75",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablevirusui",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "0a794014-5f4b-48ac-bcc1-c01c520036ad"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablevirusui_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "c7d8d335-5b76-464b-bb16-76cbe8abfa34",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('9')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('10')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('10')",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_hideransomwaredatarecovery",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "af974717-e1f1-475b-83f6-548c70e97028"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_hideransomwaredatarecovery_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "251963db-3981-4ca3-8df1-b92f0a661c75",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('10')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('10')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('11')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('11')",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_hidewindowssecuritynotificationareacontrol",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "3a9dc836-5f32-4428-a04a-1bad526d3c7b"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_hidewindowssecuritynotificationareacontrol_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "39f2d84f-4082-478d-bf5c-3317ffb14fd7",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('11')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('11')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('12')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('12')",
      "id": "12",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enablecustomizedtoasts",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "bcf504b2-0285-4ec5-8d3c-cf135d98d925"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enablecustomizedtoasts_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "e0ce0a98-40e4-47ac-82e2-9de0616c6760",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('12')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('12')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('13')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('13')",
      "id": "13",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enableinappcustomization",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "71b7efe5-c134-40d4-9d88-463592e367a7"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_enableinappcustomization_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "0a59e152-c250-43a6-88bb-72b6a48f48dd",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('13')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('13')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('14')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('14')",
      "id": "14",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_companyname",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "86d04a37-6b64-40a2-b6bf-cab433e68950"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "Doc Brown",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "d9b4a5a8-1ffb-4f01-9438-992db2988eec",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('14')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('14')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('15')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('15')",
      "id": "15",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_email",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "3338a0cc-5364-447a-a2b7-162f6050160e"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "emmett@lab.stealthpuppy.com",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "1f2edbf4-7ac9-4ad7-971a-1f7621003c62",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('15')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('15')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('16')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('16')",
      "id": "16",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_phone",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "c581d5ed-f850-4db2-a90c-66791959ddc9"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "+1234567890",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "2f747c53-d865-4302-bb12-9cb922985898",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('16')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('16')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('17')",
      "@odata.editLink": "deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('17')",
      "id": "17",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_url",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "a7cb1e1e-7c5f-4db3-9fc8-0a40c67209bb"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "https://stealthpuppy.com",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "29886cea-5b94-438e-a75f-2cbac2eddc31",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('17')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/settings('17')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('e79fc161-e57f-45d5-9e83-bf3cf8f5af88')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
