{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')",
  "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-06T03:09:47.1101821Z",
  "creationSource": null,
  "description": "Microsoft Defender Antivirus configuration policies for Windows Servers",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-03-06T03:09:47.1101821Z",
  "name": "Prod-WindowsServers-MicrosoftDefenderAntivirus",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 37,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,microsoftSense",
  "id": "55d3c355-e3f7-4e46-8b57-16ebd0921c72",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "endpointSecurityAntivirus",
    "templateDisplayName": "Microsoft Defender Antivirus",
    "templateDisplayVersion": "Version 1"
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/assignments",
  "assignments": [
    {
      "id": "55d3c355-e3f7-4e46-8b57-16ebd0921c72_2720df7f-dd0f-466b-837a-6cd711b11113",
      "source": "direct",
      "sourceId": "55d3c355-e3f7-4e46-8b57-16ebd0921c72",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": null,
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "2720df7f-dd0f-466b-837a-6cd711b11113"
      }
    }
  ],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "dac47505-f072-48d6-9f23-8d93262d58ed"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "3e920b10-3773-4ac5-957e-e5573aec6d04",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "4b6c9739-4449-4006-8e5f-3049136470ea",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('9')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('10')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('10')",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_avgcpuloadfactor",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "816cc03e-8f96-4cba-b14f-2658d031a79a"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 50,
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "37195fb1-3743-4c8e-a0ce-b6fae6fa3acd",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('10')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('10')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('11')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('11')",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "010779d1-edd4-441d-8034-89ad57a863fe",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('11')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('11')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('12')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('12')",
      "id": "12",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('12')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('12')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('13')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('13')",
      "id": "13",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f61c2788-14e4-4e80-a5a7-bf2ff5052f63"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 30,
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "608f1561-b603-46bd-bf5f-0b9872002f75",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('13')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('13')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('14')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('14')",
      "id": "14",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_daystoretaincleanedmalware",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "6f6d741c-1186-42e2-b2f2-8582febcfd60"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 7,
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "214b6feb-c9b2-4a17-af54-d51c805473e4",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('14')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('14')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('15')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('15')",
      "id": "15",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablelowcpupriority",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "cdeb96cf-18f5-4477-a710-0ea9ecc618af"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_enablelowcpupriority_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "045a4a13-deee-4e24-9fe4-985c9357680d",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('15')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('15')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('16')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('16')",
      "id": "16",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('16')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('16')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('17')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('17')",
      "id": "17",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('17')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('17')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('18')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('18')",
      "id": "18",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "6b4e3497-cfbb-4761-a152-de935bbf3f07",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('18')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('18')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('19')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('19')",
      "id": "19",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "27ca2652-46f3-4cc7-83f2-bf85ff722d84"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "70c8f42e-ee6a-4ef1-a070-cb0e9d472581",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('19')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('19')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('20')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('20')",
      "id": "20",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulequickscantime",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "784a4af1-33fa-45f2-b945-138b7ff3bcb6"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 720,
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "5d5c55c8-1a4e-4272-830d-8dc64cd3ac03",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('20')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('20')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('21')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('21')",
      "id": "21",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_signatureupdateinterval",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "89879f27-6b7d-44d4-a08e-0a0de3e9663d"
        },
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 2,
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "0af6bbed-a74a-4d08-8587-b16b10b774cb",
            "useTemplateDefault": false
          }
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('21')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('21')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('22')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('22')",
      "id": "22",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "bc47ce7d-a251-4cae-a8a2-6e8384904ab7"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "826ed4b6-e04f-4975-9d23-6f0904b0d87e",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('22')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('22')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('23')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('23')",
      "id": "23",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "5f9a9c65-dea7-4987-a5f5-b28cfd9762ba"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "3a9774b2-3143-47eb-bbca-d73c0ace2b7e",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('23')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('23')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('24')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('24')",
      "id": "24",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "afbc322b-083c-4281-8242-ebbb91398b41"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "ed077fee-9803-44f3-b045-aab34d8e6d52",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('24')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('24')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('25')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('25')",
      "id": "25",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
        },
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_block",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_quarantine",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_clean",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_block",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('25')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('25')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('26')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('26')",
      "id": "26",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "d7342aaf-833d-4afc-92d6-e9621256a3cc"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "248fdbe0-e0c9-4b47-bce1-95c8058736fb",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('26')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('26')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('27')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('27')",
      "id": "27",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "69fa7ce4-6cd8-4699-aff7-024a889c25ce"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "0333679d-3b8a-4b51-9f8e-bba39b263712",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('27')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('27')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('28')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('28')",
      "id": "28",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablednsovertcpparsing",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "522811d2-c99e-4e6d-9cf5-36779498aec6"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disablednsovertcpparsing_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "19e3f074-15d5-43ec-8718-2e09aee0a972",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('28')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('28')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('29')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('29')",
      "id": "29",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablehttpparsing",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "662abd23-4077-4b4b-a305-7f104ef28beb"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disablehttpparsing_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "d4a20dd5-8cc2-4b7e-ac84-6f76fde3cfc9",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('29')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('29')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('30')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('30')",
      "id": "30",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablesshparsing",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "f092fb32-a546-4111-a4d0-cd9f57787fd7"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disablesshparsing_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "514d2640-09d4-428e-835d-dd1d63fba8fb",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('30')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('30')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('31')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('31')",
      "id": "31",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disabletlsparsing",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "b806c934-b19f-40b5-8d87-36117976c161"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disabletlsparsing_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "a4872f4f-6588-4110-a250-635b2267a5ad",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('31')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('31')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('32')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('32')",
      "id": "32",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_enablednssinkhole",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "c2d4039a-b57e-41df-9e2a-23ace9b51972"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_enablednssinkhole_0",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "0110668a-f308-411b-9b82-6567f6bbbd9c",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('32')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('32')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('33')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('33')",
      "id": "33",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_engineupdateschannel",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "0d762a6b-9301-457c-b47b-47466280e681"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_engineupdateschannel_5",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "90b8ab4a-58fb-4b0a-9639-4c9a9a9efab8",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('33')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('33')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('34')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('34')",
      "id": "34",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_meteredconnectionupdates",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "7e3aaffb-309f-46de-8cd7-25c1a3b19e5b"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_meteredconnectionupdates_1",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "20cf972c-be3f-4bc1-93d3-781829d55233",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('34')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('34')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('35')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('35')",
      "id": "35",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_platformupdateschannel",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "737b828d-17ee-4c6a-ac43-206faea94220"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_platformupdateschannel_5",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "43b48d15-4149-4982-9086-4f9ccb0190fd",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('35')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('35')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('36')",
      "@odata.editLink": "deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('36')",
      "id": "36",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel",
        "settingInstanceTemplateReference": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
          "settingInstanceTemplateId": "368be8ef-11aa-4c0d-919f-d6ed16bc6950"
        },
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel_5",
          "settingValueTemplateReference": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
            "settingValueTemplateId": "1de23cd5-23f3-4600-88d7-570e8ebbbf39",
            "useTemplateDefault": false
          },
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('36')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/settings('36')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('55d3c355-e3f7-4e46-8b57-16ebd0921c72')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
