{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration",
  "id": "fcf3d90f-1217-4fcd-af2b-ea4fcbe49181",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-01-13T04:05:48.6106662Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2020-10-25T23:50:01.832369Z",
  "description": "Windows Update settings for broad ring Windows 10 PCs.\n\nNote: Feature update deferral is set to 0 - ensure a Feature update ring is assigned to the device.\n\nAssign to a specified group of users. May cause reboots during Autopilot if assigned to devices.",
  "displayName": "Prod-Windows-QualityUpdates-Broad",
  "version": 39,
  "deliveryOptimizationMode@odata.type": "#microsoft.graph.windowsDeliveryOptimizationMode",
  "deliveryOptimizationMode": "userDefined",
  "prereleaseFeatures@odata.type": "#microsoft.graph.prereleaseFeatures",
  "prereleaseFeatures": "userDefined",
  "automaticUpdateMode@odata.type": "#microsoft.graph.automaticUpdateMode",
  "automaticUpdateMode": "windowsDefault",
  "microsoftUpdateServiceAllowed": true,
  "driversExcluded": false,
  "installationSchedule": null,
  "qualityUpdatesDeferralPeriodInDays": 7,
  "featureUpdatesDeferralPeriodInDays": 0,
  "qualityUpdatesPaused": false,
  "featureUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime@odata.type": "#DateTimeOffset",
  "qualityUpdatesPauseExpiryDateTime": "2024-02-13T04:00:29.6769106Z",
  "featureUpdatesPauseExpiryDateTime@odata.type": "#DateTimeOffset",
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "businessReadyUpdatesOnly@odata.type": "#microsoft.graph.windowsUpdateType",
  "businessReadyUpdatesOnly": "businessReadyOnly",
  "skipChecksBeforeRestart": false,
  "updateWeeks": null,
  "qualityUpdatesPauseStartDate": null,
  "featureUpdatesPauseStartDate": null,
  "featureUpdatesRollbackWindowInDays": 10,
  "qualityUpdatesWillBeRolledBack": false,
  "featureUpdatesWillBeRolledBack": false,
  "qualityUpdatesRollbackStartDateTime@odata.type": "#DateTimeOffset",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime@odata.type": "#DateTimeOffset",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "engagedRestartDeadlineInDays": null,
  "engagedRestartSnoozeScheduleInDays": null,
  "engagedRestartTransitionScheduleInDays": null,
  "deadlineForFeatureUpdatesInDays": 3,
  "deadlineForQualityUpdatesInDays": 2,
  "deadlineGracePeriodInDays": 3,
  "postponeRebootUntilAfterDeadline": true,
  "autoRestartNotificationDismissal@odata.type": "#microsoft.graph.autoRestartNotificationDismissalMethod",
  "autoRestartNotificationDismissal": "user",
  "scheduleRestartWarningInHours": 4,
  "scheduleImminentRestartWarningInMinutes": 15,
  "userPauseAccess@odata.type": "#microsoft.graph.enablement",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess@odata.type": "#microsoft.graph.enablement",
  "userWindowsUpdateScanAccess": "enabled",
  "updateNotificationLevel@odata.type": "#microsoft.graph.windowsUpdateNotificationDisplayOption",
  "updateNotificationLevel": "defaultNotifications",
  "allowWindows11Upgrade": false,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.extendFeatureUpdatesPause": {
    "title": "microsoft.graph.extendFeatureUpdatesPause",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendFeatureUpdatesPause"
  },
  "#microsoft.graph.extendQualityUpdatesPause": {
    "title": "microsoft.graph.extendQualityUpdatesPause",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendQualityUpdatesPause"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('fcf3d90f-1217-4fcd-af2b-ea4fcbe49181')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
