{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration",
  "id": "05e9d582-2962-42d8-8100-0de6196da26b",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-01-13T04:06:01.1529388Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2022-08-01T01:26:17.282413Z",
  "description": "Windows Update settings for first ring Windows 10 PCs.\n\nNote: Feature update deferral is set to 0 - ensure a Feature update ring is assigned to the device.\n\nAssign to a specified group of users. May cause reboots during Autopilot if assigned to devices.",
  "displayName": "Prod-Windows-QualityUpdates-First",
  "version": 7,
  "deliveryOptimizationMode@odata.type": "#microsoft.graph.windowsDeliveryOptimizationMode",
  "deliveryOptimizationMode": "userDefined",
  "prereleaseFeatures@odata.type": "#microsoft.graph.prereleaseFeatures",
  "prereleaseFeatures": "userDefined",
  "automaticUpdateMode@odata.type": "#microsoft.graph.automaticUpdateMode",
  "automaticUpdateMode": "windowsDefault",
  "microsoftUpdateServiceAllowed": true,
  "driversExcluded": false,
  "installationSchedule": null,
  "qualityUpdatesDeferralPeriodInDays": 0,
  "featureUpdatesDeferralPeriodInDays": 0,
  "qualityUpdatesPaused": false,
  "featureUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime@odata.type": "#DateTimeOffset",
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesPauseExpiryDateTime@odata.type": "#DateTimeOffset",
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "businessReadyUpdatesOnly@odata.type": "#microsoft.graph.windowsUpdateType",
  "businessReadyUpdatesOnly": "userDefined",
  "skipChecksBeforeRestart": false,
  "updateWeeks": null,
  "qualityUpdatesPauseStartDate": null,
  "featureUpdatesPauseStartDate": null,
  "featureUpdatesRollbackWindowInDays": 10,
  "qualityUpdatesWillBeRolledBack": false,
  "featureUpdatesWillBeRolledBack": false,
  "qualityUpdatesRollbackStartDateTime@odata.type": "#DateTimeOffset",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime@odata.type": "#DateTimeOffset",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "engagedRestartDeadlineInDays": null,
  "engagedRestartSnoozeScheduleInDays": null,
  "engagedRestartTransitionScheduleInDays": null,
  "deadlineForFeatureUpdatesInDays": 7,
  "deadlineForQualityUpdatesInDays": 2,
  "deadlineGracePeriodInDays": 3,
  "postponeRebootUntilAfterDeadline": false,
  "autoRestartNotificationDismissal@odata.type": "#microsoft.graph.autoRestartNotificationDismissalMethod",
  "autoRestartNotificationDismissal": "notConfigured",
  "scheduleRestartWarningInHours": null,
  "scheduleImminentRestartWarningInMinutes": null,
  "userPauseAccess@odata.type": "#microsoft.graph.enablement",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess@odata.type": "#microsoft.graph.enablement",
  "userWindowsUpdateScanAccess": "enabled",
  "updateNotificationLevel@odata.type": "#microsoft.graph.windowsUpdateNotificationDisplayOption",
  "updateNotificationLevel": "defaultNotifications",
  "allowWindows11Upgrade": false,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
  "assignments": [
    {
      "@odata.type": "#microsoft.graph.deviceConfigurationAssignment",
      "@odata.id": "deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/assignments('05e9d582-2962-42d8-8100-0de6196da26b_acacacac-9df4-4c7d-9d50-4ef0226f57a9')",
      "@odata.editLink": "deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/assignments('05e9d582-2962-42d8-8100-0de6196da26b_acacacac-9df4-4c7d-9d50-4ef0226f57a9')",
      "id": "05e9d582-2962-42d8-8100-0de6196da26b_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
      "source@odata.type": "#microsoft.graph.deviceAndAppManagementAssignmentSource",
      "source": "direct",
      "sourceId": "05e9d582-2962-42d8-8100-0de6196da26b",
      "intent@odata.type": "#microsoft.graph.deviceConfigAssignmentIntent",
      "intent": "apply",
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": null,
        "deviceAndAppManagementAssignmentFilterType@odata.type": "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
        "deviceAndAppManagementAssignmentFilterType": "none"
      }
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.extendFeatureUpdatesPause": {
    "title": "microsoft.graph.extendFeatureUpdatesPause",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendFeatureUpdatesPause"
  },
  "#microsoft.graph.extendQualityUpdatesPause": {
    "title": "microsoft.graph.extendQualityUpdatesPause",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.windowsUpdateForBusinessConfiguration/microsoft.graph.extendQualityUpdatesPause"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('05e9d582-2962-42d8-8100-0de6196da26b')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
